In [3]:
import numpy as np
import pandas as pd

In [5]:
from numpy.random import randn

In [31]:
#np.random.seed(101)

In [32]:
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'E'],['W', 'X', 'Y', 'Z'])

In [10]:
df.

          W         X         Y         Z
A -0.747489  1.709142 -0.544701 -0.008810
B -0.028248  0.061550 -0.327798  0.011397
C -0.055215 -0.434698 -0.083334  0.445915
D -1.438141 -0.314142 -0.210444 -0.196216
E  1.228846  1.191585  0.490549 -0.698623

In [11]:
df['new'] = df['W'] + df['Y']

In [12]:
df

          W         X         Y         Z       new
A -0.747489  1.709142 -0.544701 -0.008810 -1.292190
B -0.028248  0.061550 -0.327798  0.011397 -0.356046
C -0.055215 -0.434698 -0.083334  0.445915 -0.138549
D -1.438141 -0.314142 -0.210444 -0.196216 -1.648585
E  1.228846  1.191585  0.490549 -0.698623  1.719395

In [13]:
df.drop('new', axis=1)

          W         X         Y         Z
A -0.747489  1.709142 -0.544701 -0.008810
B -0.028248  0.061550 -0.327798  0.011397
C -0.055215 -0.434698 -0.083334  0.445915
D -1.438141 -0.314142 -0.210444 -0.196216
E  1.228846  1.191585  0.490549 -0.698623

In [14]:
df

          W         X         Y         Z       new
A -0.747489  1.709142 -0.544701 -0.008810 -1.292190
B -0.028248  0.061550 -0.327798  0.011397 -0.356046
C -0.055215 -0.434698 -0.083334  0.445915 -0.138549
D -1.438141 -0.314142 -0.210444 -0.196216 -1.648585
E  1.228846  1.191585  0.490549 -0.698623  1.719395

In [15]:
df.drop('new', axis=1, inplace=True)

In [16]:
df

          W         X         Y         Z
A -0.747489  1.709142 -0.544701 -0.008810
B -0.028248  0.061550 -0.327798  0.011397
C -0.055215 -0.434698 -0.083334  0.445915
D -1.438141 -0.314142 -0.210444 -0.196216
E  1.228846  1.191585  0.490549 -0.698623

In [17]:
df.drop('E', axis=0)

          W         X         Y         Z
A -0.747489  1.709142 -0.544701 -0.008810
B -0.028248  0.061550 -0.327798  0.011397
C -0.055215 -0.434698 -0.083334  0.445915
D -1.438141 -0.314142 -0.210444 -0.196216

In [18]:
df

          W         X         Y         Z
A -0.747489  1.709142 -0.544701 -0.008810
B -0.028248  0.061550 -0.327798  0.011397
C -0.055215 -0.434698 -0.083334  0.445915
D -1.438141 -0.314142 -0.210444 -0.196216
E  1.228846  1.191585  0.490549 -0.698623

In [19]:
df[['W', 'Z']]

          W         Z
A -0.747489 -0.008810
B -0.028248  0.011397
C -0.055215  0.445915
D -1.438141 -0.196216
E  1.228846 -0.698623

In [20]:
df

          W         X         Y         Z
A -0.747489  1.709142 -0.544701 -0.008810
B -0.028248  0.061550 -0.327798  0.011397
C -0.055215 -0.434698 -0.083334  0.445915
D -1.438141 -0.314142 -0.210444 -0.196216
E  1.228846  1.191585  0.490549 -0.698623

In [24]:
df.loc['A']

W   -0.747489
X    1.709142
Y   -0.544701
Z   -0.008810
Name: A, dtype: float64

In [25]:
df.iloc[0]

W   -0.747489
X    1.709142
Y   -0.544701
Z   -0.008810
Name: A, dtype: float64

In [22]:
df.loc[['A', 'B']]

          W         X         Y         Z
A -0.747489  1.709142 -0.544701 -0.008810
B -0.028248  0.061550 -0.327798  0.011397

In [26]:
df.loc['A', 'Z']

-0.008809812347915702

In [28]:
df['W']['A']

-0.7474888616248933

In [29]:
df

          W         X         Y         Z
A -0.747489  1.709142 -0.544701 -0.008810
B -0.028248  0.061550 -0.327798  0.011397
C -0.055215 -0.434698 -0.083334  0.445915
D -1.438141 -0.314142 -0.210444 -0.196216
E  1.228846  1.191585  0.490549 -0.698623

In [30]:
df.loc[['A', 'E'], ['W', 'Z']]

          W         Z
A -0.747489 -0.008810
E  1.228846 -0.698623

In [33]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [34]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

*MULTI-INDEXING IN PANDAS*

In [39]:
# index level
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = '1 2 3 1 2 3'.split()
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [41]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])

In [42]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [43]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [48]:
df.loc['G1'].loc['1']

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [52]:
df.index.names = ['Groups', 'Num']

In [53]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [56]:
df.loc['G1'].loc['2']['B']

-1.1591194155484297

In [58]:
df.xs('1', level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [ ]:
df.dropna